package lin.com.bookreader.viewmodels

import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel
import lin.com.bookreader.dagger.network.retrofit.BaseUrlMap
import lin.com.bookreader.entity.Book
import lin.com.bookreader.entity.DialogSelectBean
import lin.com.bookreader.entity.DialogSelectItemBean

class MainSearchFragmentViewModel : BaseViewModel() {

    val list = listOf(
            Book(
                "起点",
                "仙逆2000",
                "耳根",
                "200",
                "8.0",
                3000,
                "第2088章 蓦然回首（大结局）",
                "2016-01-30",
                "",
                ""
            ),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book(
                "起点",
                "仙逆2989",
                "耳根",
                "200",
                "8.0",
                3000,
                "第2088章 蓦然回首（大结局）",
                "2016-01-30",
                "",
                ""
            ),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book(
                "起点",
                "蛊真人986",
                "耳根",
                "200",
                "8.0",
                3000,
                "第2088章 蓦然回首（大结局）",
                "2016-01-30",
                "",
                ""
            ),
            Book("起点", "仙逆2", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "凡人修仙传", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", ""),
            Book("起点", "蛊真人", "耳根", "200", "8.0", 3000, "第2088章 蓦然回首（大结局）", "2016-01-30", "", "")
        )

    //all web type data list
    private val webTypeList = BaseUrlMap.map.map { DialogSelectItemBean(it.key, it.value.first) }

    // the selected web
    val webType = MutableLiveData<String>(webTypeList.first().name)

    // the dialog bean
    val dialogSelectBean = DialogSelectBean(webTypeList)

    val dialogItemClickListener = fun(dialogItemBean:DialogSelectItemBean, _:Int){
        webType.postValue(dialogItemBean.name)
        loading.postValue(true)
    }
}